Revit 2027 API
FluidTemperatureSetIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual FluidTemperature Current { get; }
Public Overridable ReadOnly Property Current As FluidTemperature
	Get
public:
virtual property FluidTemperature^ Current {
	FluidTemperature^ get ();
}
abstract Current : FluidTemperature with get
override Current : FluidTemperature with get
Property Value
FluidTemperature
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace